zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100tp_44_tqfp.h
    /* P1.5 */
    P1_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_5_MSCLP_SENSE                =  4,       /* msclp.sense:13 */
    P1_5_MSCLP_SHIELD               =  5,       /* msclp.shield:13 */
    P1_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_5_SCB1_UART_TX               =  9,       /* Digital Active - scb[1].uart_tx:0 */
    P1_5_PASS0_DSI_SAR_DATA3        = 10,       /* Digital Active - pass[0].dsi_sar_data[3]:0 */
    P1_5_TCPWM_TR_IN3               = 11,       /* Digital Active - tcpwm.tr_in[3]:0 */
    P1_5_MSCLP_MSC_DDRV11           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[11] */
    P1_5_MSCLP_EXT_SYNC             = 13,       /* Digital Deep Sleep - msclp.ext_sync:0 */
    P1_5_SCB1_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[1].i2c_sda:0 */
    P1_5_SCB1_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[1].spi_mosi:0 */

    /* P1.6 */
    P1_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_6_MSCLP_SENSE                =  4,       /* msclp.sense:14 */
    P1_6_MSCLP_SHIELD               =  5,       /* msclp.shield:14 */
    P1_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_6_SCB1_UART_CTS              =  9,       /* Digital Active - scb[1].uart_cts:0 */
    P1_6_MSCLP_MSC_DDRV12           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[12] */
    P1_6_MSCLP_EXT_SYNC_CLK         = 13,       /* Digital Deep Sleep - msclp.ext_sync_clk:0 */
    P1_6_SCB1_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[1].spi_miso:0 */

    /* P1.7 */
    P1_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_7_MSCLP_SENSE                =  4,       /* msclp.sense:15 */
    P1_7_MSCLP_SHIELD               =  5,       /* msclp.shield:15 */
    P1_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_7_SCB1_UART_RTS              =  9,       /* Digital Active - scb[1].uart_rts:0 */
    P1_7_MSCLP_MSC_DDRV13           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[13] */
    P1_7_MSCLP_EXT_FRM_START        = 13,       /* Digital Deep Sleep - msclp.ext_frm_start:0 */
    P1_7_SCB1_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[1].spi_clk:0 */

    /* P2.0 */
    P2_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_0_MSCLP_SENSE                =  4,       /* msclp.sense:16 */
    P2_0_MSCLP_SHIELD               =  5,       /* msclp.shield:16 */
    P2_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_0_TCPWM_LINE2                =  8,       /* Digital Active - tcpwm.line[2]:0 */
    P2_0_SCB2_UART_RX               =  9,       /* Digital Active - scb[2].uart_rx:0 */
    P2_0_PASS0_DSI_SAR_DATA4        = 10,       /* Digital Active - pass[0].dsi_sar_data[4]:0 */
    P2_0_TCPWM_TR_IN4               = 11,       /* Digital Active - tcpwm.tr_in[4]:0 */
    P2_0_MSCLP_MSC_DDRV14           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[14] */
    P2_0_MSCLP_OBS_DATA3            = 13,       /* Digital Deep Sleep - msclp.obs_data[3] */
    P2_0_SCB0_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[0].i2c_scl:1 */
    P2_0_SCB0_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[0].spi_select0:1 */

    /* P2.1 */
    P2_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_1_MSCLP_SENSE                =  4,       /* msclp.sense:17 */
    P2_1_MSCLP_SHIELD               =  5,       /* msclp.shield:17 */
    P2_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_1_TCPWM_LINE_COMPL2          =  8,       /* Digital Active - tcpwm.line_compl[2]:0 */
    P2_1_SCB2_UART_TX               =  9,       /* Digital Active - scb[2].uart_tx:0 */
    P2_1_PASS0_DSI_SAR_DATA5        = 10,       /* Digital Active - pass[0].dsi_sar_data[5]:0 */
    P2_1_TCPWM_TR_IN5               = 11,       /* Digital Active - tcpwm.tr_in[5]:0 */
    P2_1_MSCLP_MSC_DDRV15           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[15] */
    P2_1_MSCLP_OBS_DATA2            = 13,       /* Digital Deep Sleep - msclp.obs_data[2] */
    P2_1_SCB0_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[0].i2c_sda:1 */
    P2_1_SCB0_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[0].spi_select1:1 */

    /* P2.2 */
    P2_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_2_MSCLP_SENSE                =  4,       /* msclp.sense:18 */
    P2_2_MSCLP_SHIELD               =  5,       /* msclp.shield:18 */
    P2_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_2_TCPWM_LINE3                =  8,       /* Digital Active - tcpwm.line[3]:0 */
    P2_2_SCB2_UART_CTS              =  9,       /* Digital Active - scb[2].uart_cts:0 */
    P2_2_MSCLP_MSC_DDRV16           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[16] */
    P2_2_MSCLP_OBS_DATA1            = 13,       /* Digital Deep Sleep - msclp.obs_data[1] */
    P2_2_SCB0_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[0].spi_select2:1 */

    /* P2.3 */
    P2_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_3_MSCLP_SENSE                =  4,       /* msclp.sense:19 */
    P2_3_MSCLP_SHIELD               =  5,       /* msclp.shield:19 */
    P2_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_3_TCPWM_LINE_COMPL3          =  8,       /* Digital Active - tcpwm.line_compl[3]:0 */
    P2_3_SCB2_UART_RTS              =  9,       /* Digital Active - scb[2].uart_rts:0 */
    P2_3_MSCLP_MSC_DDRV17           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[17] */
    P2_3_MSCLP_OBS_DATA0            = 13,       /* Digital Deep Sleep - msclp.obs_data[0] */
    P2_3_SCB0_SPI_SELECT3           = 15,       /* Digital Deep Sleep - scb[0].spi_select3:1 */

    /* P2.4 */
    P2_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_4_MSCLP_SENSE                =  4,       /* msclp.sense:20 */
    P2_4_MSCLP_SHIELD               =  5,       /* msclp.shield:20 */
    P2_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_4_TCPWM_LINE4                =  8,       /* Digital Active - tcpwm.line[4]:0 */
    P2_4_SCB3_UART_RX               =  9,       /* Digital Active - scb[3].uart_rx:1 */
    P2_4_PASS0_DSI_SAR_DATA6        = 10,       /* Digital Active - pass[0].dsi_sar_data[6]:0 */
    P2_4_MSCLP_MSC_DDRV18           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[18] */
    P2_4_MSCLP_EXT_SYNC             = 13,       /* Digital Deep Sleep - msclp.ext_sync:1 */
    P2_4_SCB0_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[0].spi_mosi:1 */

    /* P2.5 */
    P2_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_5_MSCLP_SENSE                =  4,       /* msclp.sense:21 */
    P2_5_MSCLP_SHIELD               =  5,       /* msclp.shield:21 */
    P2_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_5_TCPWM_LINE_COMPL4          =  8,       /* Digital Active - tcpwm.line_compl[4]:0 */
    P2_5_SCB3_UART_TX               =  9,       /* Digital Active - scb[3].uart_tx:1 */
    P2_5_PASS0_DSI_SAR_DATA7        = 10,       /* Digital Active - pass[0].dsi_sar_data[7]:0 */
    P2_5_TCPWM_TR_IN6               = 11,       /* Digital Active - tcpwm.tr_in[6]:0 */
    P2_5_MSCLP_MSC_DDRV19           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[19] */
    P2_5_MSCLP_EXT_SYNC_CLK         = 13,       /* Digital Deep Sleep - msclp.ext_sync_clk:1 */
    P2_5_SCB0_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[0].spi_miso:1 */

