zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100tp_44_tqfp.h
    /* P2.6 */
    P2_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_6_MSCLP_SENSE                =  4,       /* msclp.sense:22 */
    P2_6_MSCLP_SHIELD               =  5,       /* msclp.shield:22 */
    P2_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_6_TCPWM_LINE5                =  8,       /* Digital Active - tcpwm.line[5]:0 */
    P2_6_SCB3_UART_CTS              =  9,       /* Digital Active - scb[3].uart_cts:1 */
    P2_6_TCPWM_TR_IN0               = 11,       /* Digital Active - tcpwm.tr_in[0]:1 */
    P2_6_MSCLP_MSC_DDRV20           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[20] */
    P2_6_MSCLP_EXT_FRM_START        = 13,       /* Digital Deep Sleep - msclp.ext_frm_start:1 */
    P2_6_SCB0_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[0].spi_clk:1 */

    /* P2.7 */
    P2_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_7_MSCLP_SENSE                =  4,       /* msclp.sense:23 */
    P2_7_MSCLP_SHIELD               =  5,       /* msclp.shield:23 */
    P2_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_7_TCPWM_LINE_COMPL5          =  8,       /* Digital Active - tcpwm.line_compl[5]:0 */
    P2_7_SCB3_UART_RTS              =  9,       /* Digital Active - scb[3].uart_rts:1 */
    P2_7_MSCLP_MSC_DDRV21           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[21] */

    /* P3.1 */
    P3_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_1_MSCLP_SENSE                =  4,       /* msclp.sense:24 */
    P3_1_MSCLP_SHIELD               =  5,       /* msclp.shield:24 */
    P3_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_1_TCPWM_LINE0                =  8,       /* Digital Active - tcpwm.line[0]:1 */
    P3_1_SCB3_UART_RTS              =  9,       /* Digital Active - scb[3].uart_rts:0 */
    P3_1_PASS0_DSI_SAR_DATA8        = 10,       /* Digital Active - pass[0].dsi_sar_data[8]:0 */
    P3_1_TCPWM_TR_IN1               = 11,       /* Digital Active - tcpwm.tr_in[1]:1 */
    P3_1_MSCLP_MSC_DDRV22           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[22] */
    P3_1_SCB0_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[0].spi_select1:2 */

    /* P3.2 */
    P3_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_2_MSCLP_SENSE                =  4,       /* msclp.sense:25 */
    P3_2_MSCLP_SHIELD               =  5,       /* msclp.shield:25 */
    P3_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_2_TCPWM_LINE_COMPL0          =  8,       /* Digital Active - tcpwm.line_compl[0]:1 */
    P3_2_SCB3_UART_RX               =  9,       /* Digital Active - scb[3].uart_rx:0 */
    P3_2_PASS0_DSI_SAR_DATA9        = 10,       /* Digital Active - pass[0].dsi_sar_data[9]:0 */
    P3_2_TCPWM_TR_IN2               = 11,       /* Digital Active - tcpwm.tr_in[2]:1 */
    P3_2_MSCLP_MSC_DDRV23           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[23] */
    P3_2_CPUSS_SWD_DATA             = 13,       /* Digital Deep Sleep - cpuss.swd_data:0 */
    P3_2_SCB0_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[0].i2c_sda:2 */
    P3_2_SCB0_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[0].spi_select2:2 */

    /* P3.3 */
    P3_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_3_MSCLP_SENSE                =  4,       /* msclp.sense:26 */
    P3_3_MSCLP_SHIELD               =  5,       /* msclp.shield:26 */
    P3_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_3_SCB3_UART_TX               =  9,       /* Digital Active - scb[3].uart_tx:0 */
    P3_3_MSCLP_MSC_DDRV24           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[24] */
    P3_3_CPUSS_SWD_CLK              = 13,       /* Digital Deep Sleep - cpuss.swd_clk:0 */
    P3_3_SCB0_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[0].i2c_scl:2 */
    P3_3_SCB0_SPI_SELECT3           = 15,       /* Digital Deep Sleep - scb[0].spi_select3:2 */

    /* P4.0 */
    P4_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_0_MSCLP_SENSE                =  4,       /* msclp.sense:27 */
    P4_0_MSCLP_SHIELD               =  5,       /* msclp.shield:27 */
    P4_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_0_TCPWM_LINE1                =  8,       /* Digital Active - tcpwm.line[1]:1 */
    P4_0_SCB4_UART_RX               =  9,       /* Digital Active - scb[4].uart_rx:0 */
    P4_0_PASS0_DSI_SAR_DATA10       = 10,       /* Digital Active - pass[0].dsi_sar_data[10]:0 */
    P4_0_TCPWM_TR_IN3               = 11,       /* Digital Active - tcpwm.tr_in[3]:1 */
    P4_0_MSCLP_MSC_DDRV25           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[25] */
    P4_0_SCB1_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[1].i2c_scl:1 */
    P4_0_SCB1_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[1].spi_select0:1 */

    /* P4.1 */
    P4_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_1_MSCLP_SENSE                =  4,       /* msclp.sense:28 */
    P4_1_MSCLP_SHIELD               =  5,       /* msclp.shield:28 */
    P4_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_1_TCPWM_LINE_COMPL1          =  8,       /* Digital Active - tcpwm.line_compl[1]:1 */
    P4_1_SCB4_UART_TX               =  9,       /* Digital Active - scb[4].uart_tx:0 */
    P4_1_PASS0_DSI_SAR_DATA11       = 10,       /* Digital Active - pass[0].dsi_sar_data[11]:0 */
    P4_1_TCPWM_TR_IN4               = 11,       /* Digital Active - tcpwm.tr_in[4]:1 */
    P4_1_MSCLP_MSC_DDRV26           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[26] */
    P4_1_SCB1_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[1].i2c_sda:1 */
    P4_1_SCB1_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[1].spi_select1:1 */

    /* P4.2 */
    P4_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_2_MSCLP_SENSE                =  4,       /* msclp.sense:29 */
    P4_2_MSCLP_SHIELD               =  5,       /* msclp.shield:29 */
    P4_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_2_TCPWM_LINE2                =  8,       /* Digital Active - tcpwm.line[2]:1 */
    P4_2_SCB4_UART_CTS              =  9,       /* Digital Active - scb[4].uart_cts:0 */
    P4_2_MSCLP_MSC_DDRV27           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[27] */
    P4_2_SCB1_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[1].spi_select2:0 */

    /* P4.3 */
    P4_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_3_MSCLP_SENSE                =  4,       /* msclp.sense:30 */
    P4_3_MSCLP_SHIELD               =  5,       /* msclp.shield:30 */
    P4_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_3_TCPWM_LINE_COMPL2          =  8,       /* Digital Active - tcpwm.line_compl[2]:1 */
    P4_3_SCB4_UART_RTS              =  9,       /* Digital Active - scb[4].uart_rts:0 */
    P4_3_MSCLP_MSC_DDRV28           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[28] */
    P4_3_SCB1_SPI_SELECT3           = 15,       /* Digital Deep Sleep - scb[1].spi_select3:0 */

    /* P4.4 */
    P4_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_4_MSCLP_SENSE                =  4,       /* msclp.sense:31 */
    P4_4_MSCLP_SHIELD               =  5,       /* msclp.shield:31 */
    P4_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_4_TCPWM_LINE3                =  8,       /* Digital Active - tcpwm.line[3]:1 */
    P4_4_TCPWM_TR_IN5               = 11,       /* Digital Active - tcpwm.tr_in[5]:1 */
    P4_4_MSCLP_MSC_DDRV29           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[29] */
    P4_4_SCB1_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[1].spi_mosi:1 */

    /* P4.5 */
    P4_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_5_MSCLP_SENSE                =  4,       /* msclp.sense:32 */
    P4_5_MSCLP_SHIELD               =  5,       /* msclp.shield:32 */
    P4_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_5_TCPWM_LINE_COMPL3          =  8,       /* Digital Active - tcpwm.line_compl[3]:1 */
    P4_5_TCPWM_TR_IN6               = 11,       /* Digital Active - tcpwm.tr_in[6]:1 */
    P4_5_MSCLP_MSC_DDRV30           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[30] */
    P4_5_SCB1_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[1].spi_miso:1 */

    /* P4.6 */
    P4_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_6_MSCLP_SENSE                =  4,       /* msclp.sense:33 */
    P4_6_MSCLP_SHIELD               =  5,       /* msclp.shield:33 */
    P4_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_6_TCPWM_LINE4                =  8,       /* Digital Active - tcpwm.line[4]:1 */
    P4_6_MSCLP_MSC_DDRV31           = 12,       /* Digital Deep Sleep - msclp.msc_ddrv[31] */
    P4_6_SCB1_SPI_CLK               = 15        /* Digital Deep Sleep - scb[1].spi_clk:1 */
} en_hsiom_sel_t;

#endif /* _GPIO_PSOC4100TP_44_TQFP_H_ */


/* [] END OF FILE */
